zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA577/drivers/fsl_clock.c
    oscctlaMask =
        (VBAT_OSCCTLA_MODE_EN_MASK | VBAT_OSCCTLA_CAP_SEL_EN_MASK | VBAT_OSCCTLA_OSC_EN_MASK |
         VBAT_OSCCTLA_XTAL_CAP_SEL_MASK | VBAT_OSCCTLA_EXTAL_CAP_SEL_MASK | VBAT_OSCCTLA_COARSE_AMP_GAIN_MASK);

    if (config.updateTrim)
    {
        VBAT0->OSCCFGA = VBAT_OSCCFGA_INIT_TRIM(config.initTrim) | VBAT_OSCCFGA_CAP_TRIM(config.capTrim) |
                         VBAT_OSCCFGA_DLY_TRIM(config.dlyTrim) | VBAT_OSCCFGA_CAP2_TRIM(config.cap2Trim) |
                         VBAT_OSCCFGA_CMP_TRIM(config.cmpTrim);
    }

    if (config.mode == kVBAT_OscLowpowerModeEnable)
    {
        VBAT0->OSCCFGA = (VBAT0->OSCCFGA & ~VBAT_OSCCFGA_INIT_TRIM_MASK) | VBAT_OSCCFGA_INIT_TRIM(3);

        /* Low power mode sequence: enter startup mode first, then switch to low power mode. */
        VBAT0->OSCCTLA = (VBAT0->OSCCTLA & ~oscctlaMask) | VBAT_OSCCTLA_MODE_EN(kVBAT_OscStartupModeEnable) |
                         VBAT_OSCCTLA_OSC_EN_MASK | VBAT_OSCCTLA_XTAL_CAP_SEL(config.xtalCap) |
                         VBAT_OSCCTLA_EXTAL_CAP_SEL(config.extalCap) | VBAT_OSCCTLA_CAP_SEL_EN_MASK |
                         VBAT_OSCCTLA_COARSE_AMP_GAIN(config.ampGain);

#if (SOC_DRIVER_RETRY_TIMES != 0U)
        waitTimes = SOC_DRIVER_RETRY_TIMES;
#endif
        /* Wait for STATUSA[OSC_RDY] to set. */
        while ((VBAT0->STATUSA & VBAT_STATUSA_OSC_RDY_MASK) == 0U)
        {
#if (SOC_DRIVER_RETRY_TIMES != 0U)
            if (--waitTimes == 0U)
            {
                assert(false);
                return kStatus_Timeout;
            }
#endif
        }

        /* Clear INIT_TRIM after oscillator is ready. */
        VBAT0->OSCCFGA &= ~VBAT_OSCCFGA_INIT_TRIM_MASK;

        /* Switch to low power mode. Cap selections are forced to 0. */
        VBAT0->OSCCTLA = (VBAT0->OSCCTLA & ~oscctlaMask) | VBAT_OSCCTLA_MODE_EN(kVBAT_OscLowpowerModeEnable) |
                         VBAT_OSCCTLA_OSC_EN_MASK | VBAT_OSCCTLA_XTAL_CAP_SEL(0U) | VBAT_OSCCTLA_EXTAL_CAP_SEL(0U) |
                         VBAT_OSCCTLA_CAP_SEL_EN_MASK | VBAT_OSCCTLA_COARSE_AMP_GAIN(config.ampGain);

#if (SOC_DRIVER_RETRY_TIMES != 0U)
        waitTimes = SOC_DRIVER_RETRY_TIMES;
#endif
        /* Wait for STATUSA[OSC_RDY] to set. */
        while ((VBAT0->STATUSA & VBAT_STATUSA_OSC_RDY_MASK) == 0U)
        {
#if (SOC_DRIVER_RETRY_TIMES != 0U)
            if (--waitTimes == 0U)
            {
                assert(false);
                return kStatus_Timeout;
            }
#endif
        }
    }
    else
    {
        /* Normal/startup mode sequence. */
        VBAT0->OSCCTLA = (VBAT0->OSCCTLA & ~oscctlaMask) | VBAT_OSCCTLA_MODE_EN(config.mode) |
                         VBAT_OSCCTLA_OSC_EN_MASK | VBAT_OSCCTLA_XTAL_CAP_SEL(config.xtalCap) |
                         VBAT_OSCCTLA_EXTAL_CAP_SEL(config.extalCap) | VBAT_OSCCTLA_CAP_SEL_EN_MASK |
                         VBAT_OSCCTLA_COARSE_AMP_GAIN(config.ampGain);

#if (SOC_DRIVER_RETRY_TIMES != 0U)
        waitTimes = SOC_DRIVER_RETRY_TIMES;
#endif
        /* Wait for STATUSA[OSC_RDY] to set. */
        while ((VBAT0->STATUSA & VBAT_STATUSA_OSC_RDY_MASK) == 0U)
        {
#if (SOC_DRIVER_RETRY_TIMES != 0U)
            if (--waitTimes == 0U)
            {
                assert(false);
                return kStatus_Timeout;
            }
#endif
        }

        if (config.mode == kVBAT_OscNormalModeEnable)
        {
            /* Clear CAP_SEL */
            VBAT0->OSCCTLA &= ~(VBAT_OSCCTLA_EXTAL_CAP_SEL_MASK | VBAT_OSCCTLA_XTAL_CAP_SEL_MASK);
        }
    }

    VBAT0->OSCCLKE |= VBAT_OSCCLKE_CLKE(config.id);

    /* De-initializes the SCG ROSC */
    SCG0->ROSCCSR = SCG_ROSCCSR_ROSCERR_MASK;

    /* Unlock ROSCCSR */
    SCG0->ROSCCSR &= ~SCG_ROSCCSR_LK_MASK;

    /* Enable SOSC clock monitor and Enable ROSC */
    SCG0->ROSCCSR |= SCG_ROSCCSR_ROSCCM_MASK;

#if (SOC_DRIVER_RETRY_TIMES != 0U)
    waitTimes = SOC_DRIVER_RETRY_TIMES;
#endif
    /* Wait for ROSC clock to be valid. */
    while ((SCG0->ROSCCSR & SCG_ROSCCSR_ROSCVLD_MASK) == 0U)
    {
#if (SOC_DRIVER_RETRY_TIMES != 0U)
        if (--waitTimes == 0U)
        {
            assert(false);
            return kStatus_Timeout;
        }
#endif
    }

    return kStatus_Success;
}

/* Get IP Clk */
/*! brief  Return Frequency of selected clock
 *  return Frequency of selected clock
 */
uint32_t CLOCK_GetFreq(clock_name_t clockName)
{
    uint32_t freq = 0U;

    switch (clockName)
    {
        case kCLOCK_MainClk: /* MAIN_CLK */
            freq = CLOCK_GetMainClk();
            break;
        case kCLOCK_CoreSysClk: /* Core/system clock(CPU_CLK) */
            freq = CLOCK_GetCoreSysClkFreq();
            break;
        case kCLOCK_SYSTEM_CLK: /* AHB clock */
            freq = CLOCK_GetCoreSysClkFreq();
            break;
        case kCLOCK_BusClk: /* Bus clock */
            freq = (CLOCK_GetCoreSysClkFreq() >> 1);
            break;
        case kCLOCK_ExtClk: /* External Clock */
            freq = CLOCK_GetExtClkFreq();
            break;
        case kCLOCK_FroHf: /* FROHF */
            freq = CLOCK_GetFroHfFreq();
            break;
        case kCLOCK_FroHfDiv: /* Divided by FROHF */
            freq = CLOCK_GetFroHfDivFreq();
            break;
        case kCLOCK_Clk48M: /* CLK_48M */
            freq = CLOCK_GetClk48MFreq();
            break;
        case kCLOCK_Fro12M: /* FRO12M */
            freq = CLOCK_GetFro12MFreq();
            break;
        case kCLOCK_Fro12MDiv: /* FRO_LF_DIV */
            freq = CLOCK_GetFro12MFreq() / ((SYSCON->FROLFDIV & 0xfU) + 1U);
            break;
        case kCLOCK_Clk1M: /* CLK1M */
            freq = CLOCK_GetClk1MFreq();
            break;
        case kCLOCK_Fro16K: /* FRO16K */
            freq = CLOCK_GetFRO16KFreq();
            break;
        case kCLOCK_Clk16K0: /* CLK16K[0] */
            freq = CLOCK_GetClk16KFreq(0);
            break;
        case kCLOCK_Clk16K1: /* CLK16K[1] */
            freq = CLOCK_GetClk16KFreq(1);
            break;
        case kCLOCK_Clk16K2: /* CLK16K[2] */
            freq = CLOCK_GetClk16KFreq(2);
            break;
        case kCLOCK_SLOW_CLK: /* SYSTEM_CLK divided by 6 */
            freq = (CLOCK_GetCoreSysClkFreq() / 6);
            break;
        case kCLOCK_Pll1Clk: /* Pll1Clk */
            freq = CLOCK_GetPll1ClkFreq();
            break;
        case kCLOCK_Pll1ClkDiv: /* Pll1ClkDiv */
            freq = CLOCK_GetPll1ClkDivFreq();
            break;
        case kCLOCK_UsbPll:
            freq = CLOCK_GetUsbPllFreq();
            break;
        case kCLOCK_UsbPfdClk:
            freq = CLOCK_GetUsbPfdClkFreq();
            break;
        case kCLOCK_Osc32K0:
            freq = CLOCK_GetOsc32KFreq(0);
            break;
        case kCLOCK_Osc32K1:
            freq = CLOCK_GetOsc32KFreq(1);
            break;
        case kCLOCK_Osc32K2:
            freq = CLOCK_GetOsc32KFreq(2);
            break;
        case kCLOCK_LpOsc:
            freq = CLOCK_GetLposcFreq();
            break;
        default:
            freq = 0U;
            break;
    }
    return freq;
}

/* Get FRO 12M Clk */
/*! brief  Return Frequency of FRO 12MHz
 *  return Frequency of FRO 12MHz
 */
static uint32_t CLOCK_GetFro12MFreq(void)
{
    return ((SCG0->SIRCCSR & SCG_SIRCCSR_SIRC_CLK_PERIPH_EN_MASK) != 0U) ? 12000000U : 0U;
}

/* Get CLK 1M Clk */
/*! brief  Return Frequency of CLK 1MHz
 *  return Frequency of CLK 1MHz
 */
static uint32_t CLOCK_GetClk1MFreq(void)
{
    return 1000000U;
}

