zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA577/drivers/fsl_clock.c
    /* Reset USBPLL */
    USBHS1_PHY->PLL_SIC &= ~USBPHY_PLL_SIC_PLL_POWER_MASK;
    USBHS1_PHY->PLL_SIC |= USBPHY_PLL_SIC_PLL_POWER_MASK;

#if (SOC_DRIVER_RETRY_TIMES != 0U)
    uint32_t waitTimes = SOC_DRIVER_RETRY_TIMES;
#endif
    /* Wait for USBPLL to stabilize */
    while (0 == (USBHS1_PHY->PLL_SIC & USBPHY_PLL_SIC_PLL_LOCK_MASK))
    {
#if (SOC_DRIVER_RETRY_TIMES != 0U)
        if (--waitTimes == 0U)
        {
            assert(false);
            return kStatus_Timeout;
        }
#else
        __NOP();
#endif
    }

    /* Select the PFD clock source */
    USBHS1_PHY->ANACTRL =
        (USBHS1_PHY->ANACTRL & ~USBPHY_ANACTRL_PFD_CLK_SEL_MASK) | USBPHY_ANACTRL_PFD_CLK_SEL((uint8_t)pfdClkSel);

    /* 480 MHz * 18 / n, where n = 18-3 */
    USBHS1_PHY->PFDA = (USBHS1_PHY->PFDA & ~USBPHY_PFDA_PFD0_FRAC_MASK) | USBPHY_PFDA_PFD0_FRAC((uint8_t)pfdDiv);

    /* Ungate the PFD clock */
    USBHS1_PHY->PFDA &= ~USBPHY_PFDA_PFD0_CLKGATE_MASK;

    return kStatus_Success;
}

/* Get UsbPfdClk */
static uint32_t CLOCK_GetUsbPfdClkFreq(void)
{
    uint32_t pfdDiv       = 0U;
    uint32_t pfdClkSel    = 0U;
    uint32_t pfdOutClk    = 0U;
    uint32_t usbPhyClkSrc = 0U;
    uint32_t freq         = 0U;

    if ((0U != (USBHS1_PHY->CTRL & USBPHY_CTRL_CLKGATE_MASK)) ||
        (0U != (USBHS1_PHY->PFDA & USBPHY_PFDA_PFD0_CLKGATE_MASK)))
    {
        return 0U;
    }

    pfdDiv    = (USBHS1_PHY->PFDA & USBPHY_PFDA_PFD0_FRAC_MASK) >> USBPHY_PFDA_PFD0_FRAC_SHIFT;
    pfdClkSel = (USBHS1_PHY->ANACTRL & USBPHY_ANACTRL_PFD_CLK_SEL_MASK) >> USBPHY_ANACTRL_PFD_CLK_SEL_SHIFT;

    if ((pfdDiv < 18U) || (pfdDiv > 35U))
    {
        return 0U;
    }

    pfdOutClk = 480000000U / pfdDiv * 18U;

    /* pfdClkSel:0 - USB PHY CLK Source, 1 - PFD clock/4, 2 - PFD clock/2, 3 - PFD clock */
    if (pfdClkSel == 0U)
    {
        usbPhyClkSrc = (MRCC0->MRCC_USB1_PHY_CLKSEL & MRCC_MRCC_USB1_PHY_CLKSEL_MUX_MASK);

        if (usbPhyClkSrc == 1U)
        {
            freq = CLOCK_GetFroHfFreq();
        }
        else if (usbPhyClkSrc == 2U)
        {
            freq = CLOCK_GetExtClkFreq();
        }
        else
        {
            freq = 0U;
        }
    }
    else if (pfdClkSel == 1U)
    {
        freq = (pfdOutClk >> 2U);
    }
    else if (pfdClkSel == 2U)
    {
        freq = (pfdOutClk >> 1U);
    }
    else
    {
        freq = pfdOutClk;
    }

    return freq;
}

/* Get ENET TX CLK */
/*! brief  Initialize the ENET TX CLK to given frequency.
 *  return Nothing
 */
void CLOCK_SetupEnetTxClk(uint32_t iFreq)
{
    s_Enet_Tx_Clk_Freq = iFreq;

    return;
}

/* Get ENET TX CLK */
/*! brief  Return Frequency of ENET TX CLK
 *  return Frequency of ENET TX CLK
 */
uint32_t CLOCK_GetEnetTxClkFreq(void)
{
    return s_Enet_Tx_Clk_Freq;
}

/* Get MAIN Clk */
/*! brief  Return Frequency of Core System
 *  return Frequency of Core System
 */
uint32_t CLOCK_GetMainClk(void)
{
    uint32_t freq = 0U;

    switch ((SCG0->CSR & SCG_CSR_SCS_MASK) >> SCG_CSR_SCS_SHIFT)
    {
        case 1U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 2U:
            freq = CLOCK_GetFro12MFreq();
            break;
        case 3U:
            freq = CLOCK_GetFroHfFreq();
            break;
        case 4U:
            freq = CLOCK_GetClk16KFreq(1);
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkFreq() / ((SCG0->SPLLCSR & SCG_SPLLCSR_SPLL_DIV2_EN_MASK) ? 2U : 1U);
            break;
        case 7U:
            freq = CLOCK_GetUsbPfdClkFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

/*! brief  Return Frequency of core
 *  return Frequency of the core
 */
uint32_t CLOCK_GetCoreSysClkFreq(void)
{
    return CLOCK_GetMainClk() / ((SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_MASK) + 1U);
}

/* Get CTimer Clk */
/*! brief  Return Frequency of CTimer functional Clock
 *  return Frequency of CTimer functional Clock
 */
uint32_t CLOCK_GetCTimerClkFreq(uint32_t id)
{
    uint32_t freq   = 0U;
    uint32_t clksel = 0U;
    uint32_t clkdiv = 0U;

    assert(id <= 4U);

    switch (id)
    {
        case 0U:
            clksel = MRCC0->MRCC_CTIMER0_CLKSEL;
            clkdiv = MRCC0->MRCC_CTIMER0_CLKDIV;
            break;
        case 1U:
            clksel = MRCC0->MRCC_CTIMER1_CLKSEL;
            clkdiv = MRCC0->MRCC_CTIMER1_CLKDIV;
            break;
        case 2U:
            clksel = MRCC0->MRCC_CTIMER2_CLKSEL;
            clkdiv = MRCC0->MRCC_CTIMER2_CLKDIV;
            break;
        case 3U:
            clksel = MRCC0->MRCC_CTIMER3_CLKSEL;
            clkdiv = MRCC0->MRCC_CTIMER3_CLKDIV;
            break;
        case 4U:
            clksel = MRCC0->MRCC_CTIMER4_CLKSEL;
            clkdiv = MRCC0->MRCC_CTIMER4_CLKDIV;
            break;
        default:
            clksel = MRCC0->MRCC_CTIMER0_CLKSEL;
            clkdiv = MRCC0->MRCC_CTIMER0_CLKDIV;
            break;
    }

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 0U:
            freq = CLOCK_GetFroLfDivFreq();
            break;
        case 1U:
            freq = CLOCK_GetFroHfFreq();
            break;
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 4U:
            freq = CLOCK_GetLposcFreq();
            break;
        case 5U:
            freq = CLOCK_GetClk1MFreq();
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkDivFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}
/*! brief  Return Frequency of LPI2C functional Clock
 *  return Frequency of LPI2C functional Clock
 */
uint32_t CLOCK_GetLpi2cClkFreq(uint32_t id)
{
    uint32_t freq = 0U;

    uint32_t clksel = 0U;
    uint32_t clkdiv = 0U;

    assert(id <= 4U);

    switch (id)
    {
        case 0U:
            clksel = MRCC0->MRCC_LPI2C0_CLKSEL;
            clkdiv = MRCC0->MRCC_LPI2C0_CLKDIV;
            break;
        case 1U:
            clksel = MRCC0->MRCC_LPI2C1_CLKSEL;
            clkdiv = MRCC0->MRCC_LPI2C1_CLKDIV;
            break;
        case 2U:
            clksel = MRCC0->MRCC_LPI2C2_CLKSEL;
            clkdiv = MRCC0->MRCC_LPI2C2_CLKDIV;
            break;
        case 3U:
            clksel = MRCC0->MRCC_LPI2C3_CLKSEL;
            clkdiv = MRCC0->MRCC_LPI2C3_CLKDIV;
            break;
        case 4U:
            clksel = MRCC0->MRCC_LPI2C4_CLKSEL;
            clkdiv = MRCC0->MRCC_LPI2C4_CLKDIV;
            break;
        default:
            clksel = MRCC0->MRCC_LPI2C0_CLKSEL;
            clkdiv = MRCC0->MRCC_LPI2C0_CLKDIV;
            break;
    }

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

