zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA577/drivers/fsl_clock.c
    switch (clksel)
    {
        case 0U:
            freq = CLOCK_GetFroLfDivFreq();
            break;
        case 2U:
            freq = CLOCK_GetFroHfDivFreq();
            break;
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 5U:
            freq = CLOCK_GetClk1MFreq();
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkDivFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}
/*! brief  Return Frequency of LPSPI Clock
 *  return Frequency of LPSPI Clock
 */
uint32_t CLOCK_GetLpspiClkFreq(uint32_t id)
{
    uint32_t freq   = 0U;
    uint32_t clksel = 0U;
    uint32_t clkdiv = 0U;

    assert(id <= 5U);

    switch (id)
    {
        case 0U:
            clksel = MRCC0->MRCC_LPSPI0_CLKSEL;
            clkdiv = MRCC0->MRCC_LPSPI0_CLKDIV;
            break;
        case 1U:
            clksel = MRCC0->MRCC_LPSPI1_CLKSEL;
            clkdiv = MRCC0->MRCC_LPSPI1_CLKDIV;
            break;
        case 2U:
            clksel = MRCC0->MRCC_LPSPI2_CLKSEL;
            clkdiv = MRCC0->MRCC_LPSPI2_CLKDIV;
            break;
        case 3U:
            clksel = MRCC0->MRCC_LPSPI3_CLKSEL;
            clkdiv = MRCC0->MRCC_LPSPI3_CLKDIV;
            break;
        case 4U:
            clksel = MRCC0->MRCC_LPSPI4_CLKSEL;
            clkdiv = MRCC0->MRCC_LPSPI4_CLKDIV;
            break;
        case 5U:
            clksel = MRCC0->MRCC_LPSPI5_CLKSEL;
            clkdiv = MRCC0->MRCC_LPSPI5_CLKDIV;
            break;
        default:
            clksel = MRCC0->MRCC_LPSPI0_CLKSEL;
            clkdiv = MRCC0->MRCC_LPSPI0_CLKDIV;
            break;
    }

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 0U:
            freq = CLOCK_GetFroLfDivFreq();
            break;
        case 2U:
            freq = CLOCK_GetFroHfDivFreq();
            break;
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 5U:
            freq = CLOCK_GetClk1MFreq();
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkDivFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}
/*! brief  Return Frequency of LPUART Clock
 *  return Frequency of LPUART Clock
 */
uint32_t CLOCK_GetLpuartClkFreq(uint32_t id)
{
    uint32_t freq   = 0U;
    uint32_t clksel = 0U;
    uint32_t clkdiv = 0U;

    assert(id <= 5U);

    switch (id)
    {
        case 0U:
            clksel = MRCC0->MRCC_LPUART0_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART0_CLKDIV;
            break;
        case 1U:
            clksel = MRCC0->MRCC_LPUART1_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART1_CLKDIV;
            break;
        case 2U:
            clksel = MRCC0->MRCC_LPUART2_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART2_CLKDIV;
            break;
        case 3U:
            clksel = MRCC0->MRCC_LPUART3_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART3_CLKDIV;
            break;
        case 4U:
            clksel = MRCC0->MRCC_LPUART4_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART4_CLKDIV;
            break;
        case 5U:
            clksel = MRCC0->MRCC_LPUART5_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART5_CLKDIV;
            break;
        default:
            clksel = MRCC0->MRCC_LPUART0_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART0_CLKDIV;
            break;
    }

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 0U:
            freq = CLOCK_GetFroLfDivFreq();
            break;
        case 2U:
            freq = CLOCK_GetFroHfDivFreq();
            break;
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 4U:
            freq = CLOCK_GetLposcFreq();
            break;
        case 5U:
            freq = CLOCK_GetClk1MFreq();
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkDivFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}
/* Get I3C Clk */
/*! brief  Return Frequency of I3C Clock
 *  return Frequency of I3C Clock
 */
uint32_t CLOCK_GetI3CFClkFreq(uint32_t id)
{
    uint32_t freq   = 0U;
    uint32_t clksel = 0U;
    uint32_t clkdiv = 0U;

    assert(id <= 3U);

    switch (id)
    {
        case 0U:
            clksel = MRCC0->MRCC_I3C0_FCLK_CLKSEL;
            clkdiv = MRCC0->MRCC_I3C0_FCLK_CLKDIV;
            break;
        case 1U:
            clksel = MRCC0->MRCC_I3C1_FCLK_CLKSEL;
            clkdiv = MRCC0->MRCC_I3C1_FCLK_CLKDIV;
            break;
        case 2U:
            clksel = MRCC0->MRCC_I3C2_FCLK_CLKSEL;
            clkdiv = MRCC0->MRCC_I3C2_FCLK_CLKDIV;
            break;
        case 3U:
            clksel = MRCC0->MRCC_I3C3_FCLK_CLKSEL;
            clkdiv = MRCC0->MRCC_I3C3_FCLK_CLKDIV;
            break;
        default:
            clksel = MRCC0->MRCC_I3C0_FCLK_CLKSEL;
            clkdiv = MRCC0->MRCC_I3C0_FCLK_CLKDIV;
            break;
    }

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 0U:
            freq = CLOCK_GetFroLfDivFreq();
            break;
        case 2U:
            freq = CLOCK_GetFroHfDivFreq();
            break;
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 5U:
            freq = CLOCK_GetClk1MFreq();
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkDivFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}
/*! brief  Return Frequency of LPTMR Clock
 *  return Frequency of LPTMR Clock
 */
uint32_t CLOCK_GetLptmrClkFreq(void)
{
    uint32_t freq   = 0U;
    uint32_t clksel = (MRCC0->MRCC_LPTMR0_CLKSEL);
    uint32_t clkdiv = (MRCC0->MRCC_LPTMR0_CLKDIV);

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

