zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA577/drivers/fsl_clock.c
    switch (clksel)
    {
        case 0U:
            freq = CLOCK_GetCoreSysClkFreq();
            break;
        case 1U:
            freq = CLOCK_GetClk1MFreq();
            break;
        case 2U:
            freq = CLOCK_GetClk16KFreq(1);
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}

/*! brief  Return Frequency of dt0 Clock
 *  return Frequency of dt0.
 */
uint32_t CLOCK_GetWwdt0ClkFreq(void)
{
    uint32_t freq   = 0U;
    uint32_t clkdiv = (MRCC0->MRCC_WWDT0_CLKDIV);

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    freq = CLOCK_GetClk1MFreq();

    return freq / ((clkdiv & 0xFFU) + 1U);
}

/*! brief  Return Frequency of Wwdt1 Clock
 *  return Frequency of Wwdt1.
 */
uint32_t CLOCK_GetWwdt1ClkFreq(void)
{
    uint32_t freq   = 0U;
    uint32_t clksel = (MRCC0->MRCC_WWDT1_CLKSEL);
    uint32_t clkdiv = (MRCC0->MRCC_WWDT1_CLKDIV);

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 0U:
            freq = CLOCK_GetClk16KFreq(1);
            break;
        case 1U:
            freq = CLOCK_GetFroHfDivFreq();
            break;
        case 2U:
            freq = CLOCK_GetClk1MFreq();
            break;
        case 3U:
            freq = CLOCK_GetClk1MFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}

/*! brief  Return Frequency of FlexCAN FCLK
 *  return Frequency of FlexCAN FCLK.
 */
/*! brief  Return Frequency of FlexCAN Clock
 *  param  id : FlexCAN instance ID
 *  return Frequency of FlexCAN Clock.
 */
uint32_t CLOCK_GetFlexcanClkFreq(uint32_t id)
{
    uint32_t freq = 0U;
    assert(id <= 1U);

    uint32_t clksel = (id == 0) ? (MRCC0->MRCC_FLEXCAN0_CLKSEL) : (MRCC0->MRCC_FLEXCAN1_CLKSEL);
    uint32_t clkdiv = (id == 0) ? (MRCC0->MRCC_FLEXCAN0_CLKDIV) : (MRCC0->MRCC_FLEXCAN1_CLKDIV);

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 1U:
            freq = CLOCK_GetFroHfFreq();
            break;
        case 2U:
            freq = CLOCK_GetFroHfDivFreq();
            break;
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 4:
            freq = CLOCK_GetUsbPllFreq();
            break;
        case 6:
            freq = CLOCK_GetPll1ClkDivFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}

/*! brief  Return Frequency of Flexspi CLK
 *  return Frequency of Flexspi CLK.
 */
uint32_t CLOCK_GetFlexspiClkFreq(void)
{
    uint32_t freq = 0U;

    uint32_t clksel = MRCC0->MRCC_FLEXSPI0_CLKSEL;
    uint32_t clkdiv = MRCC0->MRCC_FLEXSPI0_CLKDIV;

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 1U:
            freq = CLOCK_GetFroHfFreq();
            break;
        case 4U:
            freq = CLOCK_GetUsbPfdClkFreq();
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}

/*! brief  Return Frequency of TSI CLK
 *  return Frequency of TSI CLK.
 */
uint32_t CLOCK_GetTsiClkFreq(void)
{
    uint32_t freq   = 0U;
    uint32_t clksel = MRCC0->MRCC_TSI0_CLKSEL;
    uint32_t clkdiv = MRCC0->MRCC_TSI0_CLKDIV;

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 0U:
            freq = CLOCK_GetFroLfDivFreq();
            break;
        case 2U:
            freq = CLOCK_GetFroHfDivFreq();
            break;
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 5:
            freq = CLOCK_GetClk1MFreq();
            break;
        case 6:
            freq = CLOCK_GetPll1ClkDivFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}

/*! brief  Return Frequency of ENET MRR CLK
 *  return Frequency of ENET MRR CLK.
 */
uint32_t CLOCK_GetEnetRmiiClkFreq(void)
{
    uint32_t freq   = 0U;
    uint32_t clksel = MRCC0->MRCC_RMII_CLKSEL;
    uint32_t clkdiv = MRCC0->MRCC_RMII_CLKDIV;

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}

/*! brief  Return Frequency of ENET PTP REF CLK
 *  return Frequency of ENET PTP REF CLK.
 */
uint32_t CLOCK_GetEnetPtpRefClkFreq(void)
{
    uint32_t freq   = 0U;
    uint32_t clksel = MRCC0->MRCC_E1588_CLKSEL;
    uint32_t clkdiv = MRCC0->MRCC_E1588_CLKDIV;

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 4U:
            freq = CLOCK_GetEnetTxClkFreq();
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}

/*! brief  Return Frequency of TENBASET_PHY CLK
 *  return Frequency of TENBASET_PHY CLK.
 */
uint32_t CLOCK_GetTenbaset_PhyClkFreq(void)
{
    uint32_t freq   = 0U;
    uint32_t clksel = MRCC0->MRCC_T1S0_CLKSEL;
    uint32_t clkdiv = MRCC0->MRCC_T1S0_CLKDIV;

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}

